/**
 * Author: Bilal Saad
 * GitHub: bilalsaad87/motologin
 * License: https://creativecommons.org/licenses/by/3.0/
 * Date: 08-28-2023
 * Language: Arabic
 */

const textElement = document.getElementById('text');
const words = [
    // Motovations 
    'كل يوم هو يوم جديد لبداية جديدة وإمكانيات غير محدودة',
    'الابتسامة هي أقوى سلاح في مواجهة الصعاب',
    'النجاح هو ليس نهاية الرحلة، بل مجرد بداية لمغامرة جديدة',
    'القوة لا تأتي من كسر الأشياء، بل من تجاوزها',
    'التفاؤل هو المفتاح الذي يفتح أبواب النجاح',
    'الشجاعة ليست عدم الخوف، بل هي التغلب عليه',
    // Encouraging Reminders
    'لا تيأس أبداً، فالعقبات مجرد فرص لتظهر قوتك',
    'كل يوم هو بداية جديدة وفرصة لتحقيق أحلامك',
    'الابتسامة تعكس جمال قلبك وتضيء وجهك',
    'قيمتك لا تعتمد على رأي الآخرين بل على كيفية رؤيتك لذاتك',
    'الأمل هو مفتاح لبناء غد أفضل',
    'أنت تستحق السعادة والنجاح بكل تأكيد',
    // Affirmations
    'أنا قوي وقادر على تحقيق أهدافي',
    'أستمتع بكل لحظة في حياتي',
    'أستحق النجاح والازدهار في كل مجالات حياتي',
    'أنا مليء بالطاقة الإيجابية وأنشرها حولي',
    'أنا مبدع وأجلب الإبداع إلى كل جانب من حياتي',
    'أنا قوي وقادر على التغلب على أي تحدي',
    // Team Collaboration Emphasis
    'عندما نعمل معاً، ننجز أشياء رائعة',
    'العمل الجماعي يجعل الأحلام تتحقق',
    'النجاح ليس نتيجة فردية، بل هو جهد جماعي',
    'العمل الجماعي هو القوة الخفية التي تحقق النجاح الباهر',
    'الجماعة التي تعمل معاً تحقق أمورًا عظيمة',
    'على حدة، نحن قطرة واحدة. معاً، نحن محيط',
    // Wellness and Self-Care
    'العناية بالذات هي استثمار في مستقبلك',
    'السعادة تبدأ من داخلك، فاحرص على العناية بروحك وجسدك',
    'الراحة ليست ترفًا، بل هي حاجة أساسية للجسم والعقل',
    'الاهتمام بنفسك ليس أنانيًا، بل هو ضروري لتقديم أفضل نسخة من نفسك للعالم',
    'عندما تعتني بنفسك بشكل جيد، تزدهر حياتك بشكل جميل',
    'الحب والاحترام للذات هما أساس العافية والسعادة',
    // Goal Setting and Growth
    'الهدف ليس مجرد حلم، بل هو خطة واضحة للوصول إلى المستقبل',
    'النمو المستدام يأتي من تحديد أهداف والالتزام بالتعلم المستمر',
    'اعمل بجد لتحقيق أهدافك، ولا تدع شيئًا يحجب طموحك',
    'كن واثقًا في رؤيتك، وحدد أهدافك بوضوح. الثقة والتصميم هما المفتاحان لتحقيق النجاح',
    'النجاح هو نتاج من إرادة قوية وتصميم ثابت لتحقيق أهدافك، مهما كانت التحديات',
    'لا تخشى الفشل، بل اعتبره خطوة أخرى نحو النجاح',
    // Inspirational Stories
    'الصعاب هي الفرص المخفية',
    'عش بسرور، حب بصدق، ابتسم دائمًا',
    'على كل شروق شمس هناك فرصة جديدة',
    'النجاح هو تراكم الجهود الصغيرة التي تتراكم يومًا بعد يوم',
    'لا تقل أنك صغير، لا تدري أي أثر ستتركه في العالم',
    'إن السر الوحيد لتحقيق أي شيء هو أن تؤمن به بشدة',
    // Acts of Kindness and Gratitude
    'أفعال اللطف والامتنان هي لغة لا تحتاج إلى ترجمة',
    'الإنسانية تتجلى في اللحظات البسيطة من اللطف والإيثار',
    'معروف اليوم يزرع زهرة في حديقة الغد',
    'الامتنان هو زهرة تنمو في أرض القلب',
    'العطاء يملأ اليد والقلب في آن واحد',
    'عندما تزرع بذور اللطف، تحصد ثمار السعادة',
    // Visuals of Nature and Tranquility
    'السعادة تكمن في لحظات السكينة في وسط الطبيعة',
    'كلما ازدادت همومي، زاد احتياجي للهدوء وجمال الطبيعة',
    'عندما أشعر بضيق، أجد راحتي في أحضان الطبيعة',
    'عندما نتأمل في الطبيعة، نجد أنفسنا',
    'في غمرة الطبيعة، نجد هدوءًا لا يضاهى'
];
let wordIndex = 0;
let charIndex = 0;

function type() {
    if (charIndex < words[wordIndex].length) {
        textElement.textContent += words[wordIndex].charAt(charIndex);
        charIndex++;
        setTimeout(type, 100);
    } else {
        setTimeout(erase, 5000);
    }
}

function erase() {
    if (charIndex > 0) {
        textElement.textContent = words[wordIndex].substring(0, charIndex - 1);
        charIndex--;
        setTimeout(erase, 50);
    } else {
        wordIndex = (wordIndex + 1) % words.length;
        setTimeout(type, 100);
    }
}

document.addEventListener('DOMContentLoaded', () => {
    setTimeout(type, 1000);
});